GabeQ/GeorgFischerClinic/ble_workspace_v8/project_zero_app_cc2650launchxl/Debug/configPkg/package/cfg/app_ble_uartlog_pem3.c
/* Module__gatePrms__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__gatePrms__C, ".const:xdc_runtime_LoggerCallback_Module__gatePrms__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__gatePrms xdc_runtime_LoggerCallback_Module__gatePrms__C = ((CT__xdc_runtime_LoggerCallback_Module__gatePrms)0);

/* Module__id__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__id__C, ".const:xdc_runtime_LoggerCallback_Module__id__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__id xdc_runtime_LoggerCallback_Module__id__C = (xdc_Bits16)0x8;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerDefined__C, ".const:xdc_runtime_LoggerCallback_Module__loggerDefined__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerDefined xdc_runtime_LoggerCallback_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerObj__C, ".const:xdc_runtime_LoggerCallback_Module__loggerObj__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerObj xdc_runtime_LoggerCallback_Module__loggerObj__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerFxn0__C, ".const:xdc_runtime_LoggerCallback_Module__loggerFxn0__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerFxn0 xdc_runtime_LoggerCallback_Module__loggerFxn0__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerFxn1__C, ".const:xdc_runtime_LoggerCallback_Module__loggerFxn1__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerFxn1 xdc_runtime_LoggerCallback_Module__loggerFxn1__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerFxn2__C, ".const:xdc_runtime_LoggerCallback_Module__loggerFxn2__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerFxn2 xdc_runtime_LoggerCallback_Module__loggerFxn2__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerFxn4__C, ".const:xdc_runtime_LoggerCallback_Module__loggerFxn4__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerFxn4 xdc_runtime_LoggerCallback_Module__loggerFxn4__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__loggerFxn8__C, ".const:xdc_runtime_LoggerCallback_Module__loggerFxn8__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__loggerFxn8 xdc_runtime_LoggerCallback_Module__loggerFxn8__C = ((CT__xdc_runtime_LoggerCallback_Module__loggerFxn8)0);

/* Module__startupDoneFxn__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Module__startupDoneFxn__C, ".const:xdc_runtime_LoggerCallback_Module__startupDoneFxn__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Module__startupDoneFxn xdc_runtime_LoggerCallback_Module__startupDoneFxn__C = ((CT__xdc_runtime_LoggerCallback_Module__startupDoneFxn)0);

/* Object__count__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Object__count__C, ".const:xdc_runtime_LoggerCallback_Object__count__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Object__count xdc_runtime_LoggerCallback_Object__count__C = 1;

/* Object__heap__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Object__heap__C, ".const:xdc_runtime_LoggerCallback_Object__heap__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Object__heap xdc_runtime_LoggerCallback_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Object__sizeof__C, ".const:xdc_runtime_LoggerCallback_Object__sizeof__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Object__sizeof xdc_runtime_LoggerCallback_Object__sizeof__C = sizeof(xdc_runtime_LoggerCallback_Object__);

/* Object__table__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_Object__table__C, ".const:xdc_runtime_LoggerCallback_Object__table__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_Object__table xdc_runtime_LoggerCallback_Object__table__C = xdc_runtime_LoggerCallback_Object__table__V;

/* outputFxn__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_outputFxn__C, ".const:xdc_runtime_LoggerCallback_outputFxn__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_outputFxn xdc_runtime_LoggerCallback_outputFxn__C = ((CT__xdc_runtime_LoggerCallback_outputFxn)((xdc_Fxn)uartLog_outputFxn));

/* createInstFxn__C */
#pragma DATA_SECTION(xdc_runtime_LoggerCallback_createInstFxn__C, ".const:xdc_runtime_LoggerCallback_createInstFxn__C");
__FAR__ const CT__xdc_runtime_LoggerCallback_createInstFxn xdc_runtime_LoggerCallback_createInstFxn__C = ((CT__xdc_runtime_LoggerCallback_createInstFxn)((xdc_Fxn)xdc_runtime_LoggerCallback_defaultCreate));


/*
 * ======== xdc.runtime.Main INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(xdc_runtime_Main_Module__diagsEnabled__C, ".const:xdc_runtime_Main_Module__diagsEnabled__C");
__FAR__ const CT__xdc_runtime_Main_Module__diagsEnabled xdc_runtime_Main_Module__diagsEnabled__C = (xdc_Bits32)0x6190;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(xdc_runtime_Main_Module__diagsIncluded__C, ".const:xdc_runtime_Main_Module__diagsIncluded__C");
__FAR__ const CT__xdc_runtime_Main_Module__diagsIncluded xdc_runtime_Main_Module__diagsIncluded__C = (xdc_Bits32)0x6190;

/* Module__diagsMask__C */
#pragma DATA_SECTION(xdc_runtime_Main_Module__diagsMask__C, ".const:xdc_runtime_Main_Module__diagsMask__C");
__FAR__ const CT__xdc_runtime_Main_Module__diagsMask xdc_runtime_Main_Module__diagsMask__C = ((CT__xdc_runtime_Main_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma DATA_SECTION(xdc_runtime_Main_Module__gateObj__C, ".const:xdc_runtime_Main_Module__gateObj__C");
__FAR__ const CT__xdc_runtime_Main_Module__gateObj xdc_runtime_Main_Module__gateObj__C = ((CT__xdc_runtime_Main_Module__gateObj)((void*)(xdc_runtime_IGateProvider_Handle)&ti_sysbios_gates_GateHwi_Object__table__V[0]));

